In [10]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats

In [1]:
import os
print(os.getcwd())

C:\Users\alokg\Desktop\MachineLearning\MLKN\practiceCodes

In [3]:
os.listdir()

['.ipynb_checkpoints',
 'CaliforniaHousePricePrediction.ipynb',
 'convergence_algorithm.py',
 'dummyHousePrice.csv',
 'DummyHousePrice.ipynb',
 'LinearRegression1.ipynb',
 'RidgeRegression.ipynb',
 'Untitled.ipynb']

In [12]:
data = pd.read_csv("dummyHousePrice.csv")

In [14]:
data

    House_ID  Area_sqft  Bedrooms  Bathrooms  Age_yrs  Location_Score  Price
0          1       1200         2          1       10               6     65
1          2       1500         3          2        5               7     90
2          3        900         2          1       20               5     45
3          4       2000         4          3        2               9    150
4          5       1800         3          2        8               8    120
5          6       1100         2          1       12               6     60
6          7       2500         4          3        1               9    200
7          8       1600         3          2        6               7    110
8          9       1400         3          2       15               6     85
9         10       1000         2          1       18               5     50
10        11       2200         4          3        4               8    170
11        12       1300         2          2       10               6     75

In [38]:
data.head()

   House_ID  Area_sqft  Bedrooms  Bathrooms  Age_yrs  Location_Score  Price
0         1       1200         2          1       10               6     65
1         2       1500         3          2        5               7     90
2         3        900         2          1       20               5     45
3         4       2000         4          3        2               9    150
4         5       1800         3          2        8               8    120

In [16]:
# in this dataset, Price should be the target variable, also some relations that comes into observation are:
# 1. Area_sqft^ Price^
# 2. Bedrooms^ Price^
# 3. Bathrooms^ Price^
# 4. Age_yrs^ Price !^
# 5. Location_Score^ Price^

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   House_ID        12 non-null     int64
 1   Area_sqft       12 non-null     int64
 2   Bedrooms        12 non-null     int64
 3   Bathrooms       12 non-null     int64
 4   Age_yrs         12 non-null     int64
 5   Location_Score  12 non-null     int64
 6   Price           12 non-null     int64
dtypes: int64(7)
memory usage: 804.0 bytes

In [34]:
# print(data['Price'].mean)
print(data['Price'].describe())

count     12.000000
mean     101.666667
std       49.696046
min       45.000000
25%       63.750000
50%       87.500000
75%      127.500000
max      200.000000
Name: Price, dtype: float64

In [36]:
data.describe()

,House_ID,Area_sqft,Bedrooms,Bathrooms,Age_yrs,Location_Score,Price
count,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000
mean,6.500000,1541.666667,2.833333,1.916667,9.250000,6.833333,101.666667
std,3.605551,498.102460,0.834847,0.792961,6.121868,1.403459,49.696046
min,1.000000,900.000000,2.000000,1.000000,1.000000,5.000000,45.000000
25%,3.750000,1175.000000,2.000000,1.000000,4.750000,6.000000,63.750000
50%,6.500000,1450.000000,3.000000,2.000000,9.000000,6.500000,87.500000
75%,9.250000,1850.000000,3.250000,2.250000,12.750000,8.000000,127.500000
max,12.000000,2500.000000,4.000000,3.000000,20.000000,9.000000,200.000000